# Content 
- [Preview](#preview)
- [Data formating](#section-1)
- [EDA](#subsection-11)
- [Data preparation](#subsection-12)
- [Merging tables](#section-2)
- [Encoding tables](#section-2)

<a id="preview"></a>

***

## Preview 
Take a quick look at both files in order to understand what we are going to work with, how data is stored and in which formats. Before uploading both files have been saved in different formats. CSV and XLSX. We can change the format of dictionary file from xlsx. to csv. manually by opening file in Excel and saving it as csv file. However the pandas library can read both formats. All we need to do is using operators read_csv for csv file and read_excel for xlsx file as it is shown below.

***

In [21]:
import pandas as pd

In [22]:
df_studens = pd.read_csv("student_data.csv")
df_dictionary = pd.read_excel("student_data_dictionary.xlsx")

***

Once files are read we can take a look how they a look like in order to understand what we are going to work with and which manupulations we need to do.

***

In [31]:
df_studens.head(5)

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Previous qualification (grade),Nacionality,Mother's qualification,Father's qualification,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,1,17,5,171.0,1,1,122.0,1,19,12.0,...,0,0.0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,1,15,1,9254.0,1,1,160.0,1,1,3.0,...,0,6.0,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,1,1,5,9070.0,1,1,122.0,1,37,37.0,...,0,6.0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,1,17,2,9773.0,1,1,122.0,1,38,37.0,...,0,6.0,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,2,39,1,8014.0,0,1,100.0,1,37,38.0,...,0,6.0,6,6,13.000000,0,13.9,-0.3,0.79,Graduate

In [32]:
df_dictionary.head(5)

,Variable Name,Role,Type,Demographic,Description,Units
0,Marital Status,Feature,Integer,Marital Status,1 â€“ single 2 â€“ married 3 â€“ widower 4 â€“ divorce...,NaN
1,Application mode,Feature,Integer,NaN,1 - 1st phase - general contingent 2 - Ordinan...,NaN
2,Application order,Feature,Integer,NaN,Application order (between 0 - first choice; a...,NaN
3,Course,Feature,Integer,NaN,33 - Biofuel Production Technologies 171 - Ani...,NaN
4,Daytime/evening attendance,Feature,Integer,NaN,1 â€“ daytime 0 - evening,NaN

***

It looks that initial dataset was devided into a two parts or data was being collected in this way in a first place. The main table contains foreign keys which connect a specific cell with a defenition in the second table. The second table contains primary keys for main table. I may suggest that those tables are called relational database, and using this method for storing data in this case has several advantages:
1. This method saves memory in tables with multiple repetitions.
2. It can keep data private and secure, without enclosing personal data.
3. This approach helps to get red of potential bias or at least to reduce it. For instance, if some company or department publishes a dataset they can substitute information which may be misinterpretted using keys, and keep table with definitions unpublished.

***

In [40]:
df_studens.describe()

,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Previous qualification (grade),Nacionality,Mother's qualification,Father's qualification,Mother's occupation,...,Curricular units 1st sem (without evaluations),Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP
count,4424.000000,4424.000000,4423.000000,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,4423.000000,4424.000000,...,4424.000000,4424.000000,4423.000000,4424.000000,4424.000000,4423.000000,4424.000000,4424.000000,4424.000000,4424.000000
mean,18.669078,1.727848,8856.458738,0.890823,4.577758,132.613314,1.873192,19.561935,22.271987,10.960895,...,0.137658,0.541817,6.231743,8.063291,4.435805,10.229941,0.150316,11.566139,1.228029,0.001969
std,17.484682,1.313793,2063.763479,0.311897,10.216592,13.188332,6.914514,15.603186,15.343244,26.418253,...,0.690880,1.918546,2.196038,3.947951,3.014764,5.211367,0.753774,2.663850,1.382711,2.269935
min,1.000000,0.000000,33.000000,0.000000,1.000000,95.000000,1.000000,1.000000,1.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,7.600000,-0.800000,-4.060000
25%,1.000000,1.000000,9085.000000,1.000000,1.000000,125.000000,1.000000,2.000000,3.000000,4.000000,...,0.000000,0.000000,5.000000,6.000000,2.000000,10.750000,0.000000,9.400000,0.300000,-1.700000
50%,17.000000,1.000000,9238.000000,1.000000,1.000000,133.100000,1.000000,19.000000,19.000000,5.000000,...,0.000000,0.000000,6.000000,8.000000,5.000000,12.200000,0.000000,11.100000,1.400000,0.320000
75%,39.000000,2.000000,9556.000000,1.000000,1.000000,140.000000,1.000000,37.000000,37.000000,9.000000,...,0.000000,0.000000,7.000000,10.000000,6.000000,13.333333,0.000000,13.900000,2.600000,1.790000
max,57.000000,9.000000,9991.000000,1.000000,43.000000,190.000000,109.000000,44.000000,44.000000,194.000000,...,12.000000,19.000000,23.000000,33.000000,20.000000,18.571429,12.000000,16.200000,3.700000,3.510000

In [41]:
df_studens.dtypes

Marital status                                     object
Application mode                                    int64
Application order                                   int64
Course                                            float64
Daytime/evening attendance                          int64
Previous qualification                              int64
Previous qualification (grade)                    float64
Nacionality                                         int64
Mother's qualification                              int64
Father's qualification                            float64
Mother's occupation                                 int64
Father's occupation                                 int64
Admission grade                                   float64
Displaced                                          object
Educational special needs                           int64
Debtor                                            float64
Tuition fees up to date                            object
Gender                                              int64
Scholarship holder                                  int64
Age at enrollment                                  object
International                                     float64
Curricular units 1st sem (credited)                object
Curricular units 1st sem (enrolled)                 int64
Curricular units 1st sem (evaluations)              int64
Curricular units 1st sem (approved)                 int64
Curricular units 1st sem (grade)                  float64
Curricular units 1st sem (without evaluations)      int64
Curricular units 2nd sem (credited)                 int64
Curricular units 2nd sem (enrolled)               float64
Curricular units 2nd sem (evaluations)              int64
Curricular units 2nd sem (approved)                 int64
Curricular units 2nd sem (grade)                  float64
Curricular units 2nd sem (without evaluations)      int64
Unemployment rate                                 float64
Inflation rate                                    float64
GDP                                               float64
Target                                             object
dtype: object

Some columns were not included in the statistic summary due to they have a format object and can not be recognised despite being a numeric values. However in our case it is even better for us. Futhermore we had better to format others columns in the same object format.

In [35]:
unique_course = df_studens['Course'].unique()
print(unique_values)

[ 171. 9254. 9070. 9773. 8014. 9991. 9500. 9238. 9670. 9853. 9085. 9130.
 9556. 9147. 9003.   33. 9119.   nan]

In [39]:
unique_Marital_status = df_studens['Marital status'].unique()
print(unique_Marital_Status)

['1' '2' '4' '?' '3' '5' '6']

As we can see some of features contain foreign key for second dataset and some of them contain numerical value such as columns "Unemployment rate" or "GDP". in this case we need identify columns which are supposed to contain keys and columns with numerical values. All keys in the student table must be perceived as objects format.
Also we can notice that some of the columns contain symbols which are mentioned in dictionary file such as "?" in the "Marital status" or "nan" in the column "Course". Removing rows which contain those symbols may helps to process the data, however the issue can be deeper.
1. The symbols which we may identify as errors may be keys and serve to connect cells between two tables. Even in this case in may be challanging and time consuming to compare those keys manually.
2. Also there may be the opposite situation, when we include in our analysis keys which actually dont have a defenition in a dictionary.
For example if we have a table with employees ID and departments and we want to summarise the quantity of employees in each department. We may include people who already left the company or ID was generated by accident and table was not updated timely. 

I see three approaches for further data preparation process:

1. Identify features which contain foreign keys, format them as a string and treat them as a string values such as ID. It will allow us to do EDA and analyses. Additionally this approach will save time for operations, memory and computing power. However there may be a problem with quality of our EDA and with a futher interpritation. 
2. Merging datasets. Substitute foreign keys with their definitions. It will allow us to identify missing values even if cells contain values. For example, if the column "Marital status" will contain single numerical values after merging we will be able to assign them as "Unknown" category. However, the size of the file with database will grow, with means more memory, computing power and time for code to run will be spent.
3. Mixed approach which I am going to use. Technically, we can merge data, make a data preparation proccess. And after devide data back. This apporoach may be helpful if we want to save resourses and perform proper preparation process. However, this method requires many manipulations with data.

Now we are able to create a plan which provides the order of operation we need to get done:

1. Transform dictionary table.
We need to extract all foreign keys from the dictionary file and store them separately where each table will define keys for specific column. It may be challenging because all keys from each column are placed in the same cell without any delimitation. To fix that we will use library "re" which provides syntax for identifying a patterns.
2. Merging datasets
Tables we are going to extract from dictionary dataset will be merged with student dataset.
3. EDA and data preparation.
After compliting previos stages we will be able to identify and process all issues with data set.
4. Transforming back.
If those tables being stored separatly I can assume there is a reason for that. As I mentioned before it may be for saving space, computing power, ethical and confidential policy or different reason. So, I think it is important to format datasets back after tidying them up. Additionally, properly cleaned and stored database will make it much easier to operate it in the future.

## Data separating

The aim of this stage is dividing dictionary dataset into separate table which will provide defenitions for table with student data.

After several attempts it was established that row data in the cells which contains keys and their defenitions has no delimitation. Considering it we need to use library re which provides a syntax for determining delimiters manually.

In [ ]:
import pandas as pd
import re

def replace_text(text):
    return text.replace("No. ", "No.")

original_table = pd.read_excel("student_data_dictionary.xlsx")

row_index = 1
column_name = 'Description'

text = original_table.at[row_index, column_name]

text = replace_text(text)
print(text)